Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON KO>EN PSYCHIC STUDIES.tmx
Source language: ko
Languages: en

source: 휴~ 다행이다 하긴 너한테서 그런 향기가 날 리가 없지…
en: phew! that’s fortunate. well, I guess there’s no way such a sweet fragrance would come from you...

source: 더러운 악귀!
en: what a nasty evil spirit!

source: 아까 왔던 그 사람
en: remember the guy who came by the classroom?

source: …일단 급한 불은 껐는데
en: the biggest fire is out for now...

source: 1 기술 기술 과학 가정 국어
en: 1 Tech Tech Science Home Ec Korean

source: 언젠가…
en: then someday...

source: 누굴 좋아하게 된 건
en: it’s my first time...

source: 지난번엔 좀 더 버티는 것 같더니,
en: last time, you held back a bit longer.

source: 그 대회가 그렇게 중요해?
en: is the competition that important?

source: 너랑 의주랑 요즘 이상한 것 같길래
en: it’s just... you and euijoo are acting strange lately.

source: 어이, 아무리 김태희라도 말이 심하잖아
en: hey. I know it’s taehee, but aren’t your words a bit harsh?

source: 난 원래 욕 안 하는데 지금은 욕할 거 같아
en: I normally don’t curse, but I might swear right now.

source: 이신.
en: shin.

source: 씨ㅂ…
en: f*ck...

source: 됐어 너 매일 장난만 치고
en: stop it. you only joke around.

source: 니 무슨 부인데?
en: which club are you in?

source: 우리가 기억할게
en: we’ll always remember him.

source: 니 애비가 찾는다
en: hey. your dad’s asking for you.

source: 진주!!
en: pearl!!!

source: 좋은 거 아니야?
en: ...to go to heaven?

source: 그냥… 어떤 영력에 끌려와보니 태희였어
en: I just... followed some spiritual power... and it led me to taehee.

source: 김찬규…!
en: chankyu!

source: 나 자신도 잘 모르는 주제에…
en: ...I couldn’t even figure myself out...

source: 뭐야 대체?
en: what the heck was that?

source: 야 김찬규
en: hey, chankyu.

source: 우리의 능력이 증폭된 건 그 사람 때문인 거 같아요!
en: I think he’s the reason why our powers got stronger!

source: 진주한테 제대로 설명하고 사과해.
en: you better explain properly and apologize to pearl.

source: 지 않는다
en: SHOWS

source: 배
en: SH

source: 나중에 보면 인사해~
en: see you next time!

source: 속닥..
en: WHISPER

source: 부같은 거 정한 적 없는 것 같은데…?
en: I don’t remember signing up for one though...

source: 나 고백을 너무 자주 받는데 연애를 하는 게 맞는지 모르겠어
en: I get asked out so much, but I’m not sure if I can date someone.

source: 응… 아야얏…
en: uh-huh... owww...

source: 됐다…!
en: it worked!

source: 이미진 WIIL RETURN
en: MIJIN LEE WILL RETURN

source: 뭐어???
en: whaaat?!!!

source: 쟤 어때보이냐?
en: what is she thinking?

source: 어떻게 나한테 다시 반복시킬지도 알고 있어
en: and how you’ll make me repeat everything again.

source: 하지만 난 너에게 최면 건 적이 없어
en: but I never even tried to doing it.

source: 그냥 억지로 성불시키면 그만
en: I can just force the ghost into heaven.

source: 와, 씨…!!
en: holy sh*t!!!

source: 그러니까 네 맘대로 하라고
en: so do whatever you want.

source: 보건실 가자!
en: let’s go to the nurse’s office!

source: 그럼 걔도 초능력자라는 거야?
en: so you’re saying he has a superpower too?

source: 세상에 불우한 죽음은 너 하나가 아냐
en: you’re not the only one who died an unlucky death.

source: 안 들어가…?
en: ...hurt so much?!

source: 양말치고는 좋은 냄새였지… 여자애 거라 그런가…
en: they’re socks... but they smell good. is it because they’re a girl’s socks?

source: 뭐…??
en: what?!

source: 더 이상은 못 버텨!
en: I can’t hold off any longer!

source: 아버지가 돌아가신게 이미 옛날인 거 나도 알아
en: I already know that my father passed away a really long time ago...

source: 아무도 아빠를 알아주지 않아!!
en: no one recognizes your efforts, dad!!!

source: 아니, 너네 전부
en: for all of you.

source: 너 역시 정신머리가 이상한 새끼구나
en: I knew it. you’re a nutcase.

source: '네 친구니까.'{j}라고.
en: it’s because I’m your friend.{j}

source: 김태희가 네 아빠냐?
en: then is taehee your dad?

source: 도와줘!!
en: help me!!!

source: 모르긴 내가 뭘 몰라?
en: of course I know.

source: 흠…
en: hm...

source: 아까도 일진인 거 모르고 깝치다가 맞을 뻔하고…
en: I didn’t even know I was cursing at a bully earlier and almost got beaten up...

source: 네 마음은 잘 알겠어
en: I get what you’re saying.

source: 그럼 무슨 상담하려구??
en: then what do you need help with?!

source: 너… 이 개ㅅ끼…
en: you... little b*tch...

source: 검은 악령의 손이 나를 덮친 후로 기억이…
en: I don’t remember... after the evil spirit grabbed me...

source: 그정도냐 제기랄!!
en: what the-! am I really that bad?!

source: 아빠는 가끔 무리해서 다른 사람을 돕곤 했는데
en: my dad often overexerted himself to help others.

source: 나도 애써 한 번 더 할 필요는 없지
en: well, there’s no need for me to do this all over again.

source: 아니, 그니까 그딴 거 안 한다고
en: hey, I said I don’t want that kind of relationship.

source: 넌 뒤졌으니까 패드립 아니지?
en: you’re already dead, so that shouldn’t be too insulting, right?

source: 생기부를 신경 쓰고 공부를 잘함.근데 일진임
en: cares a lot about his grades and studies hard, but he’s a bully.

source: 그런 후회와 그리움에 사로잡혀 있을 무렵,
en: as I became consumed by such regret and yearning...

source: 김찬규…
en: chankyu...

source: 알림 1 알림 2
en: Notice 1 Notice 2

source: 먹힌 건가?
en: did it work?

source: 아직 상담은 끝나지 않았어!!
en: I’m not done helping you yet!!!

source: 무대 위 조형물이 떨어져서 크게 다치게 된다…
en: an object will fall from above the stage and hurt her badly...

source: 간호 장교들이 왔대
en: the nurse officers are here.

source: 언제까지고 아빠만 그리워하며 슬퍼할 순 없어
en: I can’t keep yearning for my dad and being sad forever.

source: 에이~ 니네 둘 친한 거 다 알아!
en: aw, come on! I know you two are tight!

source: 그래, 정신 차리자 엄마랑 어떻게든 잘 살아가는 게 최선이야
en: I should pull myself together. my mom and I have to continue living as best we can.

source: 아버지 피 위에서…
en: on my father’s blood...

source: …님?
en: master?

source: 헐!
en: oh, no!

source: 난 진주가 해달라는 대로 해줬어
en: I did everything pearl asked me to do.

source: 너도 화장 ㅈ나 공들이고 있잖아!
en: says the one who’s putting a sh*tload of effort into his makeup!

source: 이진주-!!!
en: pearl lee!!!

source: 그런게 있다니까요!
en: it’s real!

source: 내일 뭐 입지!!!!!!
en: what should I wear tomorrow?!!!

source: 데이트도 못해봤는데 너네 때문에 다 망했어!!
en: you guys ruined everything! I didn’t even get to go on a date with her!!!

source: 지금 전해졌다고 하는 능력은 셋.
en: the dragon bestowed three superpowers.

source: 그래, 그동안의 추억도 있고…
en: right, we do have lots of memories together...

source: 확인만 하려던 게 그 녀석들이 있어서 나서버렸어
en: I just wanted to check, but I ended up blabbering because of them.

source: 이건 어쩔 수 …!
en: this can’t be helped!

source: 운명처럼
en: as if it’s fate.

source: 아니…!
en: n-no!

source: 그래도 잘 됐다!
en: well, that worked out well!

source: 영력이 쩔어주면 좋은 게 있어??
en: what’s the advantage of having all that energy?

source: 시간이나..
en: or a moment in time...

source: 쟨 누구야?
en: who’s that?

source: 우정이 그렇게 좋으시단다
en: he said he loves his friends too much.

source: 운명이 보인다는 놈도 한 치 앞을 모르는데!!
en: if that punk who claims to see fate can’t figure out the future completely,

source: 그게 안돼
en: but it’s hard.

source: 공감이야
en: I agree.

source: 그리고 너도 쓰레기 줍기 다 끝났다며?
en: didn’t you say you finished picking up trash anyway?

source: 왜 무시해
en: so why do you keep ignoring me?

source: 저기… 나 이제 가볼게…
en: uh... I should go now...

source: 다음 화에 계속
en: to be continued...

source: 냈지.
en: we turned it in already.

source: 존ㄴ 어이없네 김우찬.
en: woochan’s f*cking unbelievable...

source: 그 자식… 능력은!
en: it’s because... his super power...

source: 야, 누가 너 욕 하나 보네 ㅋㅋ
en: haha, maybe someone’s talking behind your back.

source: 그럼 가는 걸로 알게!
en: okay, we’ll assume you’re coming!

source: 텁
en: GRAB

source: 그럴 줄 알았다!
en: serves you right!

source: 죽음은 죽음으로 끝냈어야 할 일
en: once you’re dead, it should be the end.

source: 저도요, 아버지!!
en: me too, father!!!

source: 학교 나오기 전을 생각해봐라∙∙∙ ∙∙∙ .
en: think back to what happened before you came to school today...

source: 야, 나 요새 스트레스 때문에 매운 거 땡겨서 미치겠어ㅜㅜ
en: oh, I’m so stressed nowadays that I keep craving something really spicy!

source: … 그럼
en: then...

source: 패스!
en: skip!

source: 그러니까 차라리 서로 같이 있는 게 더 나을지도 몰라요
en: ...so it may be better for them to be near each other...

source: 연애는 생각한 적도 없어
en: I never intended to date anyone.

source: 얘네 지금 뭐 하는 거야…?
en: what are they doing...?

source: 쟤 연기하는 거야
en: she’s acting.

source: 뒈져버려!
en: just screw yourself!

source: 뭐해!!!
en: hurry!!!

source: 아버지는 실종처리 되셨다고 전달받았다.
en: I received news that my father had been reported missing.

source: 왜 저래… 어!
en: what’s wrong with- oh!

source: 어쩔 수 없지… 야, 다음 미술실 가자!
en: oh well... hey, let’s go to the art room next!

source: 어때?!
en: how is it?!

source: 내가 괜히 끼어들었네 미안해
en: sorry for getting all up in your business.

source: 니가 본인을 위해 타인을 학살하길
en: ...but you’re trying to slaughter others for your own sake.

source: 닥쳐봐 좀
en: will you just shut up?

source: 잠까안-!
en: waaait!

source: 그럴 정신이나 있었나
en: you were totally preoccupied.

source: 뭐야, 뭐야~ 무슨 일 있어?
en: what is it? did something happen?

source: 미친 저게 뭐야!!
en: what the hell is that?!

source: 귀신이 말이 좀 심했지?
en: the ghost was hard on you, wasn’t she?

source: 하지 마!!
en: stop it!!!

source: 기가 약한건가??
en: is his energy weak?!

source: 믿음은 한 순간이지만 결과는 오래간다.
en: faith only requires a moment, but its consequences are long-lasting...

source: 아주 시험은 지만 내나∙∙∙ ∙∙∙ .
en: does he think this is the only exam we have?

source: 미정이 영력이 약해서니까,
en: it’s because mijung’s spiritual energy is weak.

source: 이미진 때문에 정신없었는데 살았다
en: thank goodness I got away from mijin... she was chaotic...

source: 됐어!
en: forget it!

source: 6시간이야 그 시간 안에 너네 아빠 찾을 수 있어?
en: ...but it’ll only last six hours. will that be enough time to find your dad?

source: 뭐긴,
en: who am I?

source: 나 성불 시키려고?!
en: are you sending me to heaven?!

source: 커헉…!
en: cough-!

source: 설마…!
en: no way!

source: 방금 뭐라고?
en: what did you just say?

source: 야, 뒤질래?
en: hey! wanna die?

source: 찬규님이 고생할 필요없어요!
en: sir, you don’t have to go through that trouble!
